app/controllers/admin_controller.rb

  def show_all
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def changeStatus
    id = params[:id]
    newStatus = params[:newStatus]
    @order = Order.find(id)
    @order.status = newStatus
    @order.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "orders" SET "status" = $1 WHERE "orders"."id" = $2  [["status", "In Progress"], ["id", 1]]