app/controllers/api_controller.rb

INSERT INTO "orders" ("customer_id", "service", "booking_date", "booking_slot", "customer_comments", "name", "address", "phone", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    @order[:origin_of_request] = "Mobile App"
    @order[:initiated_on] = Time.zone.now
    @order[:rating] = 0
    @order[:feedback] = 'nil'
    @order[:amount] = 0
    @order[:vendor_id] = 0
    @order[:status] = 'Initiated'

    @order.save

SELECT "orders".* FROM "orders" WHERE (customer_id = 1)
---
  def get_all
    @orders = Order.where("customer_id = " + params[:customer_id])