app/controllers/generic_orders_controller.rb

INSERT INTO "orders" ("name", "phone", "customer_id", "email", "origin_of_request", "service", "initiated_on", "rating", "feedback", "amount", "vendor_id", "status", "address", "booking_date", "booking_slot", "customer_comments", "coupon_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    if current_user != nil
      @order[:customer_id] = current_user.id
      @order[:email] = current_user.email
    else
      @order[:email] = params[:email]
    end

    if browser.mobile?
      @order[:origin_of_request] = "Mobile Browser"
    else
      @order[:origin_of_request] = "Desktop Browser"
    end

    @order[:service] = cookies[:service]
    @order[:initiated_on] = DateTime.now
    @order[:rating] = 0
    @order[:feedback] = 'nil'
    @order[:amount] = 0
    @order[:vendor_id] = 0
    @order[:status] = 'Initiated'
    @order[:name] = params[:name]
    @order[:address] = params[:house] + ", " + params[:street] + ", " + (params[:city]?params[:city]:cookies[:city]) + ", " + params[:pincode]
    @order[:phone] = params[:phone]
    @order[:booking_date] = cookies[:date]
    @order[:booking_slot] = cookies[:slot]
    @order[:customer_comments] = cookies[:customer_notes]
    @order[:coupon_code] = cookies[:coupon_code]
    @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "orders" SET "customer_id" = $1, "service" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["customer_id", 66], ["service", "electrical"], ["updated_at", "2015-08-11 19:35:54.224708"], ["id", 1]]
---
  def update
    @order = Order.find(params[:id])

    if @order.update(order_params)

SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = $1 LIMIT 1  [["customer_id", 1]]
---
  def displayUserOrders
    if current_user == nil
      redirect_to :new_user_session
    else
      user_id = current_user.id
      @orders = Order.where("customer_id = " + user_id.to_s)